In [1]:
#Constrói os dicionários com os dados fornecidos para as bases:

consulta = {'cod_benefic' : ['123456','635241','968574'],
'cod_servico' : ['101010','101010','101010'],
'dat_execucao' : ['02/01/2016','03/01/2016','04/01/2016'],
'valor' : [65,65,65]}

exame = {'cod_benefic' : ['123456','123456','635241','635241','968574'],
'cod_servico' : ['401231','401250','401261','401250','401261'],
'dat_execucao' : ['02/01/2016','02/01/2016','03/01/2016','03/01/2016','04/01/2016'],
'valor' : [18,10,5,10,5]}

In [2]:
#import o pacote pandas
import pandas as pd

# transforma o dicionario em pandas dataframe
base_consulta = pd.DataFrame(data=consulta)
base_exame = pd.DataFrame(data=exame)

#transforma a data do tipo string para datetime
base_consulta['dat_execucao'] = pd.to_datetime(base_consulta['dat_execucao'])
base_exame['dat_execucao'] = pd.to_datetime(base_exame['dat_execucao'])

# pode usar df.dtypes para verificar os tipos das variaveis do seu df(dataframe)
# df.head() para mostrar algumas linhas do seu df

In [4]:
#Faz o join das tabelas
df3 = pd.merge(base_consulta,base_exame,how='inner', on=['cod_benefic','dat_execucao'],suffixes=('_t1', '_t2'))

#Mostra as primeiras linhas
df3.head()

  cod_benefic cod_servico_t1 dat_execucao  valor_t1 cod_servico_t2  valor_t2
0      123456         101010   2016-02-01        65         401231        18
1      123456         101010   2016-02-01        65         401250        10
2      635241         101010   2016-03-01        65         401261         5
3      635241         101010   2016-03-01        65         401250        10
4      968574         101010   2016-04-01        65         401261         5